{"config": [{"config": {"trainable": true, "bias_regularizer": null, "batch_input_shape": [null, 32, 32, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "filters": 128, "padding": "valid", "name": "conv2d_1", "dtype": "float32", "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "filters": 128, "padding": "valid", "name": "conv2d_2", "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "filters": 128, "padding": "valid", "name": "conv2d_3", "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "filters": 128, "padding": "valid", "name": "conv2d_4", "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "filters": 128, "padding": "valid", "name": "conv2d_5", "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "activation_5", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"trainable": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "activity_regularizer": null, "filters": 128, "padding": "valid", "name": "conv2d_6", "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "activation_6", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"trainable": true, "bias_regularizer": null, "units": 5120, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_regularizer": null, "units": 36, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_7", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "keras_version": "2.0.4", "backend": "tensorflow", "class_name": "Sequential"}